artillery/load-test.yml
config:
  target: http://localhost:8080
  payload:
    path: "../data/tokens.csv"
    fields:
      - "tokenImage"
  processor: "./log-responses.js"
  http:
    timeout: 3  # 3 segundo timeout para terminar rápido
  plugins:
    metrics-by-endpoint:
      useOnlyRequestNames: true
    publish-metrics:
      - type: json
        output: "results/5tps.json"
  phases:
    - duration: 10   # Ramp up 10s
      arrivalRate: 0
    - duration: 40   # Maintain 40s
      arrivalRate: 5  # 5 TPS
    - duration: 10   # Ramp down 10s
      arrivalRate: 0

scenarios:
  - name: "Passive Liveness Load Test"
    flow:
      - post:
          url: "/api/v1/selphid/passive-liveness/evaluate/token"
          headers:
            Content-Type: application/json
            Accept: application/json
          json:
            tokenImage: "{{ tokenImage }}"
          capture:
            - json: "$.status"
              as: "responseStatus"
            - json: "$.message" 
              as: "responseMessage"
          expect:
            - statusCode: 200
            - contentType: application/json
            - hasProperty: status
          afterResponse: "logResponse"

# Environment variables override
environments:
  local:
    target: http://localhost:8080
    plugins:
      publish-metrics:
        - type: json
          output: "results/4tps.json"
    phases:
      - duration: 10   # Ramp up 10s
        arrivalRate: 0
      - duration: 40   # Maintain 40s
        arrivalRate: 4  # 4 TPS for local testing
      - duration: 10   # Ramp down 10s
        arrivalRate: 0
        
  stress:
    target: http://localhost:8080
    plugins:
      publish-metrics:
        - type: json
          output: "results/6tps.json"
    phases:
      - duration: 10   # Ramp up 10s
        arrivalRate: 0
      - duration: 40   # Maintain 40s
        arrivalRate: 6  # 6 TPS for stress testing
      - duration: 10   # Ramp down 10s
        arrivalRate: 0